---
kind: enumMember
id: F:Autodesk.Revit.DB.AttachmentType.Overlay
enum: Autodesk.Revit.DB.AttachmentType
source: html/1656f19c-da78-adae-59f2-e1821b1600ef.htm
---
# Autodesk.Revit.DB.AttachmentType.Overlay

The link is an overlay, only meant to be seen in this file.
 If the host is linked into another file, the link will not
 be brought along.